Revit 2024 API
IFCFileReadOptions Constructor
 Creates a default IFCFileReadOptions.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IFCFileReadOptions()
Visual Basic
Public Sub New
Visual C++
public:
IFCFileReadOptions()
See Also
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace